#############################
############ 索引 ############
#############################
########## 组合索引 ##########
#############################

use sqldb;

############################# 创建组合索引 #############################
############################# 创建普通组合索引 #############################
create index phone_num_name_index on students (phone_num, name);
############################# 删除普通组合索引 #############################
drop index phone_num_name_index on students;

############################# 创建唯一组合索引 #############################
create unique index phone_num_name_unique_index on students (phone_num, name);
############################# 删除唯一组合索引 #############################
drop index phone_num_name_unique_index on students;
